src/cf/src/Catalogs/ТелеграмОбработка/ТелеграмОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмОбработка</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчиститьКонтекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСборкиОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбработки</name>
    <type>
      <types>EnumRef.ТелеграмТипыОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияНадКонтекстомАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияНадКонтекстом</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ТелеграмДействияСКонтекстом</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмСтатусыИспользования/ТелеграмСтатусыИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСтатусыИспользования</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмОбработка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ДействияНадКонтекстомАвто = ДействияНадКонтекстом.Количество();
		Если ПометкаУдаления Тогда
			Статус = Перечисления.ТелеграмСтатусыИспользования.Выключен;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
